#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudwatch_log_group.current_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-weather-lambda]
aws_ecr_repository.future_predictions: Refreshing state... [id=c18-climate-monitor-future-predictions-ecr]
aws_security_group.allow_5432: Refreshing state... [id=sg-00146638977b9f8dc]
aws_ecr_repository.dashboard: Refreshing state... [id=c18-climate-monitor-dashboard-ecr]
aws_cloudwatch_log_group.current_reading_orchestrator: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-reading-orchestrator-lambda]
aws_ecr_repository.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-ecr]
aws_cloudwatch_log_group.historic_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-air-quality-lambda]
aws_ecr_repository.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-ecr]
aws_cloudwatch_log_group.current_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-air-quality-lambda]
aws_iam_role.orchestrator_lambda: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam]
aws_ecr_repository.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-ecr]
aws_cloudwatch_log_group.future_climate: Refreshing state... [id=/aws/lambda/c18-climate-monitor-future-predictions-lambda]
aws_ecr_repository.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-ecr]
aws_ecr_repository.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-ecr]
aws_cloudwatch_log_group.live_flood_warnings: Refreshing state... [id=/aws/lambda/c18-climate-monitor-live-flood-warnings-lambda]
aws_ecr_repository.flood_warning_check: Refreshing state... [id=c18-climate-monitor-flood-warning-check-ecr]
aws_cloudwatch_log_group.historic_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-weather-lambda]
data.aws_iam_policy_document.example: Reading...
data.aws_iam_policy_document.example: Read complete after 0s [id=1734155287]
aws_cloudwatch_log_group.location_assignment: Refreshing state... [id=/aws/lambda/c18-climate-monitor-location-assignment-lambda]
aws_ecr_repository.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-ecr]
aws_ecr_repository.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-ecr]
aws_ecr_repository.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_iam_role.lambda: Refreshing state... [id=c18-climate-monitor-lambda-iam]
aws_iam_role_policy_attachment.orchestrator_lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy.invoke_lambdas: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam:invoke-other-lambdas]
aws_vpc_security_group_ingress_rule.allow_ingress_5432: Refreshing state... [id=sgr-0c0647e7620fc928e]
aws_db_instance.climate: Refreshing state... [id=db-FRWD4BKFF4THTAGHZDARGIT56U]
aws_iam_role_policy_attachment.lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_ecr_repository_policy.example: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_lambda_function.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-lambda]
aws_lambda_function.future_climate: Refreshing state... [id=c18-climate-monitor-future-predictions-lambda]
aws_lambda_function.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-lambda]
aws_lambda_function.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-lambda]
aws_lambda_function.live_flood_warnings: Refreshing state... [id=c18-climate-monitor-live-flood-warnings-lambda]
aws_lambda_function.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-lambda]
aws_lambda_function.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-lambda]
aws_lambda_function.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-lambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.new_location_orchestrator will be created
  + resource "aws_cloudwatch_log_group" "new_location_orchestrator" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/c18-climate-monitor-new-location-orchestrator-lambda"
      + name_prefix       = (known after apply)
      + region            = "eu-west-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "production"
          + "Function"    = "c18-climate-monitor-new-location-orchestrator-lambda"
        }
      + tags_all          = {
          + "Environment" = "production"
          + "Function"    = "c18-climate-monitor-new-location-orchestrator-lambda"
        }
    }

  # aws_lambda_function.current_air_quality will be updated in-place
  ~ resource "aws_lambda_function" "current_air_quality" {
        id                             = "c18-climate-monitor-current-air-quality-lambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "DB_PASSWORD" = (sensitive value)
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "api_key"     = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.current_reading_orchestrator will be updated in-place
  ~ resource "aws_lambda_function" "current_reading_orchestrator" {
        id                             = "c18-climate-monitor-current-reading-orchestrator-lambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "DB_PASSWORD" = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.current_weather will be updated in-place
  ~ resource "aws_lambda_function" "current_weather" {
        id                             = "c18-climate-monitor-current-weather-lambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "DB_PASSWORD" = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.future_climate will be updated in-place
  ~ resource "aws_lambda_function" "future_climate" {
        id                             = "c18-climate-monitor-future-predictions-lambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "DBPASSWORD" = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.historic_air_quality will be updated in-place
  ~ resource "aws_lambda_function" "historic_air_quality" {
        id                             = "c18-climate-monitor-historic-air-quality-lambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "DB_PASSWORD" = (sensitive value)
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "api_key"     = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.historic_weather will be updated in-place
  ~ resource "aws_lambda_function" "historic_weather" {
        id                             = "c18-climate-monitor-historic-weather-lambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "DB_PASSWORD" = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.live_flood_warnings will be updated in-place
  ~ resource "aws_lambda_function" "live_flood_warnings" {
        id                             = "c18-climate-monitor-live-flood-warnings-lambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "DB_PASSWORD" = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.location_assignment will be updated in-place
  ~ resource "aws_lambda_function" "location_assignment" {
        id                             = "c18-climate-monitor-location-assignment-lambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "DBPASSWORD" = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.new_location_orchestrator will be created
  + resource "aws_lambda_function" "new_location_orchestrator" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "c18-climate-monitor-new-location-orchestrator-lambda"
      + id                             = (known after apply)
      + image_uri                      = "129033205317.dkr.ecr.eu-west-2.amazonaws.com/c18-climate-monitor-new-location-orchestrator-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::129033205317:role/c18-climate-monitor-orchestrator-lambda-iam"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "MY_AWS_ACCESS_KEY_ID"     = (sensitive value)
              + "MY_AWS_REGION"            = "eu-west-2"
              + "MY_AWS_SECRET_ACCESS_KEY" = (sensitive value)
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config {
          + application_log_level = "INFO"
          + log_format            = "JSON"
          + log_group             = (known after apply)
          + system_log_level      = "INFO"
        }

      + tracing_config (known after apply)
    }

Plan: 2 to add, 8 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @lindengraves, Action: `pull_request`*